Project/Toir/src/Reports/торо_ПлановыеВнеплановыеРемонты/торо_ПлановыеВнеплановыеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПлановыеВнеплановыеРемонты</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>гкс_КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВнешниеОснованияДляРабот</name>
  <comment> //TOIR20-370: включенно индексирование для ID и ПлановаяДатаРемонта</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РемонтыОборудования_id</name>
    <comment>Не используется! РемонтыОборудования_ID искать в измерении ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Содержит РемонтыОборудования_ID, несмотря на реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеМероприятия/торо_ЗавершенныеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>ОсновнаяИерархия</name>
      <description>Основная иерархия</description>
    </items>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныеЭлементыВДереве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_ПлановыеВнеплановыеРемонты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаКон", "НаборДанныхПланВнеплан");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхПланВнеплан.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Итог.РассчитыватьВремя КАК РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Итог.ИД КАК ИД,
		|	ВТ_Итог.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор КАК ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ВТ_Итог.Ремонт КАК Ремонт,
		|	ВТ_Итог.ДокументАкт КАК ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения КАК СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта КАК ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта КАК ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции КАК ВремяРеакции,
		|	ВТ_Итог.Смета КАК Смета,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Итог.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Итог.РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта,
		|	ВТ_Итог.ИД,
		|	ВТ_Итог.ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения,
		|	ВТ_Итог.Ремонт,
		|	ВТ_Итог.ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции,
		|	ВТ_Итог.Смета,
		|	ЗНАЧЕНИЕ(Справочник." + ТекИерархия.ТипРеквизитаОР + ".ПустаяСсылка)
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	НЕ ВТ_Итог.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхПланВнеплан.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Итог.РассчитыватьВремя КАК РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Итог.ИД КАК ИД,
		|	ВТ_Итог.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор КАК ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ВТ_Итог.Ремонт КАК Ремонт,
		|	ВТ_Итог.ДокументАкт КАК ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения КАК СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта КАК ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта КАК ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции КАК ВремяРеакции,
		|	ВТ_Итог.Смета КАК Смета,
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Итог.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Итог.РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта,
		|	ВТ_Итог.ИД,
		|	ВТ_Итог.ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения,
		|	ВТ_Итог.Ремонт,
		|	ВТ_Итог.ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции,
		|	ВТ_Итог.Смета,
		|	ВТ_Итог.ОбъектРемонта
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	НЕ ВТ_Итог.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта";
		
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	дс_ДобавитьПараметрыВСКД();
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы)
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда	
			Если (Строка(Элемент.Параметр) = "УчитыватьПланГрафикиППР"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьППР"))Тогда
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьРегламентныеМероприятия"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьРегламентныеМероприятия")) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоДефектам"
				И Не ПолучитьЗначениеФО("торо_УчетВыявленныхДефектовОборудования")) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоВнешнимОснованиям"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьВнешниеОснованияДляРабот")) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь; 
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
КонецПроцедуры

Функция ПолучитьЗначениеФО(ТекущаяОпция) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(ТекущаяОпция);
	
КонецФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	табВД.ОтказавшийЭлемент КАК ОбъектРемонта,
	|	табВД.ID КАК ИД,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПланДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	табВД.Регистратор КАК ДокИнициатор,
	|	табВД.Период КАК ДатаОбнаружения,
	|	торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение КАК ВидРемонта
	|ПОМЕСТИТЬ табВД
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, &РассчетРемонтовПоДефектам = ИСТИНА) КАК табВД,
	|	Константа.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	табВО.ОбъектРемонта КАК ОбъектРемонта,
	|	табВО.ID КАК ИД,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПланДатаНач,
	|	табВО.ПлановаяДатаРемонта КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	табВО.Регистратор КАК ДокИнициатор,
	|	табВО.Период КАК ДатаОбнаружения,
	|	торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение КАК ВидРемонта
	|ПОМЕСТИТЬ табВО_безДаты
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(
	|			,
	|			&РассчетРемонтовПоВнешнимОснованиям = ИСТИНА
	|				И НЕ ID В
	|						(ВЫБРАТЬ
	|							Таб.ИД
	|						ИЗ
	|							табВД КАК Таб)) КАК табВО,
	|	Константа.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокИнициатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	таб.ОбъектРемонта КАК ОбъектРемонта,
	|	таб.ИД КАК ИД,
	|	таб.ПланДатаНач КАК ПланДатаНач,
	|	таб.ПланДатаКон КАК ПланДатаКон,
	|	таб.ФактДатаНач КАК ФактДатаНач,
	|	таб.ФактДатаКон КАК ФактДатаКон,
	|	таб.ДокИнициатор КАК ДокИнициатор,
	|	табДокументов.ДатаСоздания КАК ДатаОбнаружения,
	|	таб.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ табВО
	|ИЗ
	|	табВО_безДаты КАК таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот КАК табДокументов
	|		ПО таб.ДокИнициатор = табДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПланГрафикРемонта.ID КАК ИД,
	|	торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот КАК ПланДатаНач,
	|	торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	торо_ПланГрафикРемонта.Регистратор КАК ДокИнициатор,
	|	торо_ПланГрафикРемонта.Период КАК ДатаОбнаружения,
	|	торо_ПланГрафикРемонта.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ табППР
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, &РассчетПланГрафиковППР = ИСТИНА) КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Отменен = ЛОЖЬ
	|	И торо_ПланГрафикРемонта.Замещен = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК РассчитыватьВремя,
	|	табВД.ОбъектРемонта КАК ОбъектРемонта,
	|	табВД.ИД КАК ИД,
	|	табВД.ПланДатаНач КАК ПланДатаНач,
	|	табВД.ПланДатаКон КАК ПланДатаКон,
	|	табВД.ФактДатаНач КАК ФактДатаНач,
	|	табВД.ФактДатаКон КАК ФактДатаКон,
	|	табВД.ДокИнициатор КАК ДокИнициатор,
	|	табВД.ДатаОбнаружения КАК ДатаОбнаружения,
	|	табВД.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ табНЕРегламенты
	|ИЗ
	|	табВД КАК табВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	табВО.ОбъектРемонта,
	|	табВО.ИД,
	|	табВО.ПланДатаНач,
	|	табВО.ПланДатаКон,
	|	табВО.ФактДатаНач,
	|	табВО.ФактДатаКон,
	|	табВО.ДокИнициатор,
	|	табВО.ДатаОбнаружения,
	|	табВО.ВидРемонта
	|ИЗ
	|	табВО КАК табВО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	табППР.ОбъектРемонта,
	|	табППР.ИД,
	|	табППР.ПланДатаНач,
	|	табППР.ПланДатаКон,
	|	табППР.ФактДатаНач,
	|	табППР.ФактДатаКон,
	|	табППР.ДокИнициатор,
	|	табППР.ДатаОбнаружения,
	|	табППР.ВидРемонта
	|ИЗ
	|	табППР КАК табППР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табВД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табВО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табППР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыСрезПоследних.ID КАК ИД,
	|	торо_РемонтыСрезПоследних.ДатаНачалаПлан КАК ПланДатаНач,
	|	торо_РемонтыСрезПоследних.ДатаОкончанияПлан КАК ПланДатаКон,
	|	торо_РемонтыСрезПоследних.ДатаНачалаФакт КАК ФактДатаНач,
	|	торо_РемонтыСрезПоследних.ДатаОкончанияФакт КАК ФактДатаКон,
	|	НЕОПРЕДЕЛЕНО КАК ДатаОбнаружения,
	|	торо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыСрезПоследних.Регистратор КАК Смета
	|ПОМЕСТИТЬ Сметы
	|ИЗ
	|	РегистрСведений.торо_Ремонты.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК торо_РемонтыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	табНЕРегламенты.РассчитыватьВремя КАК РассчитыватьВремя,
	|	табНЕРегламенты.ОбъектРемонта КАК ОбъектРемонта,
	|	табНЕРегламенты.ИД КАК ИД,
	|	ЕСТЬNULL(Сметы.ПланДатаНач, табНЕРегламенты.ПланДатаНач) КАК ПланДатаНач,
	|	ЕСТЬNULL(Сметы.ПланДатаКон, табНЕРегламенты.ПланДатаКон) КАК ПланДатаКон,
	|	ЕСТЬNULL(Сметы.ФактДатаНач, табНЕРегламенты.ФактДатаНач) КАК ФактДатаНач,
	|	ЕСТЬNULL(Сметы.ФактДатаКон, табНЕРегламенты.ФактДатаКон) КАК ФактДатаКон,
	|	табНЕРегламенты.ДокИнициатор КАК ДокИнициатор,
	|	табНЕРегламенты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ЕСТЬNULL(Сметы.ВидРемонта, табНЕРегламенты.ВидРемонта) КАК ВидРемонта,
	|	Сметы.Смета КАК Смета
	|ПОМЕСТИТЬ НеРегламенты_ПлановыеДаты
	|ИЗ
	|	табНЕРегламенты КАК табНЕРегламенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сметы КАК Сметы
	|		ПО (Сметы.ИД = табНЕРегламенты.ИД)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Ремонты.ID КАК ИД,
	|	МИНИМУМ(торо_Ремонты.ДатаНачалаФакт) КАК ФактДатаНач,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ НеРегламенты_ДатаНачалаФакт
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	(торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
	|			ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_АктОВыполненииЭтапаРабот)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_Ремонты.ID,
	|	торо_Ремонты.ВидРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.Регистратор КАК ДокАкт,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ИД,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ДатаОкончания КАК ФактДатаКон,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ НеРегламенты_ДатаОкончанияФакт
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеРегламенты_ПлановыеДаты.РассчитыватьВремя КАК РассчитыватьВремя,
	|	НеРегламенты_ПлановыеДаты.ОбъектРемонта КАК ОбъектРемонта,
	|	НеРегламенты_ПлановыеДаты.ИД КАК ИД,
	|	НеРегламенты_ПлановыеДаты.ПланДатаНач КАК ПланДатаНач,
	|	НеРегламенты_ПлановыеДаты.ПланДатаКон КАК ПланДатаКон,
	|	ЕСТЬNULL(НеРегламенты_ДатаНачалаФакт.ФактДатаНач, НеРегламенты_ПлановыеДаты.ФактДатаНач) КАК ФактДатаНач,
	|	ЕСТЬNULL(НеРегламенты_ДатаОкончанияФакт.ФактДатаКон, НеРегламенты_ПлановыеДаты.ФактДатаКон) КАК ФактДатаКон,
	|	НеРегламенты_ПлановыеДаты.ДокИнициатор КАК ДокИнициатор,
	|	НеРегламенты_ПлановыеДаты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВЫБОР
	|		КОГДА НеРегламенты_ДатаОкончанияФакт.ВидРемонта ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(НеРегламенты_ДатаНачалаФакт.ВидРемонта, НеРегламенты_ПлановыеДаты.ВидРемонта)
	|		ИНАЧЕ НеРегламенты_ДатаОкончанияФакт.ВидРемонта
	|	КОНЕЦ КАК ВидРемонта,
	|	ЕСТЬNULL(НеРегламенты_ДатаОкончанияФакт.ДокАкт, НЕОПРЕДЕЛЕНО) КАК ДокАкт,
	|	ЕСТЬNULL(НеРегламенты_ПлановыеДаты.Смета, НЕОПРЕДЕЛЕНО) КАК Смета
	|ПОМЕСТИТЬ НеРегламентыОбщее
	|ИЗ
	|	НеРегламенты_ПлановыеДаты КАК НеРегламенты_ПлановыеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеРегламенты_ДатаНачалаФакт КАК НеРегламенты_ДатаНачалаФакт
	|		ПО НеРегламенты_ПлановыеДаты.ИД = НеРегламенты_ДатаНачалаФакт.ИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеРегламенты_ДатаОкончанияФакт КАК НеРегламенты_ДатаОкончанияФакт
	|		ПО НеРегламенты_ПлановыеДаты.ИД = НеРегламенты_ДатаОкончанияФакт.ИД
	|ГДЕ
	|	(НеРегламенты_ПлановыеДаты.ПланДатаНач МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ НеРегламенты_ПлановыеДаты.ПланДатаКон МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(НеРегламенты_ДатаНачалаФакт.ФактДатаНач, НеРегламенты_ПлановыеДаты.ФактДатаНач) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(НеРегламенты_ДатаОкончанияФакт.ФактДатаКон, НеРегламенты_ПлановыеДаты.ФактДатаКон) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ НеРегламенты_ПлановыеДаты.ДатаОбнаружения МЕЖДУ &ДатаНач И &ДатаКон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табНЕРегламенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Сметы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламенты_ПлановыеДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламенты_ДатаНачалаФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламенты_ДатаОкончанияФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК ОбъектРемонта,
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК ИД,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ПланДатаНач,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК ДокИнициатор,
	|	торо_ПлановыеМероприятияСрезПоследних.Период КАК ДатаОбнаружения,
	|	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия КАК ВидРемонта
	|ПОМЕСТИТЬ Регламенты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, &РассчетРеглМероприятий = ИСТИНА) КАК торо_ПлановыеМероприятияСрезПоследних
	|ГДЕ
	|	торо_ПлановыеМероприятияСрезПоследних.Отменен = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Ремонты.ID КАК ИД,
	|	МИНИМУМ(торо_Ремонты.ДатаНачалаФакт) КАК ФактДатаНач,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ РегламентыНаряды
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	(торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаРегламентноеМероприятие
	|			ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_АктОВыполненииРегламентногоМероприятия)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_Ремонты.ОбъектРемонта,
	|	торо_Ремонты.ID,
	|	торо_Ремонты.ВидРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеМероприятияСрезПоследних.ДатаОкончания КАК ФактДатаКон,
	|	торо_ЗавершенныеМероприятияСрезПоследних.Регистратор КАК ДокАкт,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ID КАК ИД,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ВидМероприятия КАК ВидРемонта
	|ПОМЕСТИТЬ РегламентыАкты
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(, &РассчетРеглМероприятий = ИСТИНА) КАК торо_ЗавершенныеМероприятияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК РассчитыватьВремя,
	|	Регламенты.ОбъектРемонта КАК ОбъектРемонта,
	|	Регламенты.ИД КАК ИД,
	|	Регламенты.ПланДатаНач КАК ПланДатаНач,
	|	Регламенты.ПланДатаКон КАК ПланДатаКон,
	|	ЕСТЬNULL(РегламентыНаряды.ФактДатаНач, Регламенты.ФактДатаНач) КАК ФактДатаНач,
	|	ЕСТЬNULL(РегламентыАкты.ФактДатаКон, Регламенты.ФактДатаКон) КАК ФактДатаКон,
	|	Регламенты.ДокИнициатор КАК ДокИнициатор,
	|	Регламенты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВЫБОР
	|		КОГДА РегламентыАкты.ВидРемонта ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(РегламентыНаряды.ВидРемонта, Регламенты.ВидРемонта)
	|		ИНАЧЕ РегламентыАкты.ВидРемонта
	|	КОНЕЦ КАК ВидРемонта,
	|	ЕСТЬNULL(РегламентыАкты.ДокАкт, НЕОПРЕДЕЛЕНО) КАК ДокАкт
	|ПОМЕСТИТЬ РегламентыОбщее
	|ИЗ
	|	Регламенты КАК Регламенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегламентыНаряды КАК РегламентыНаряды
	|		ПО Регламенты.ИД = РегламентыНаряды.ИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегламентыАкты КАК РегламентыАкты
	|		ПО Регламенты.ИД = РегламентыАкты.ИД
	|ГДЕ
	|	(Регламенты.ПланДатаНач МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ Регламенты.ПланДатаКон МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(РегламентыНаряды.ФактДатаНач, Регламенты.ФактДатаНач) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(РегламентыАкты.ФактДатаКон, Регламенты.ФактДатаКон) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ Регламенты.ДатаОбнаружения МЕЖДУ &ДатаНач И &ДатаКон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Регламенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегламентыНаряды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегламентыАкты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеРегламентыОбщее.РассчитыватьВремя КАК РассчитыватьВремя,
	|	НеРегламентыОбщее.ОбъектРемонта КАК ОбъектРемонта,
	|	НеРегламентыОбщее.ИД КАК ИД,
	|	НеРегламентыОбщее.ПланДатаНач КАК ПланДатаНач,
	|	НеРегламентыОбщее.ПланДатаКон КАК ПланДатаКон,
	|	НеРегламентыОбщее.ФактДатаНач КАК ФактДатаНач,
	|	НеРегламентыОбщее.ФактДатаКон КАК ФактДатаКон,
	|	НеРегламентыОбщее.ДокИнициатор КАК ДокИнициатор,
	|	НеРегламентыОбщее.ДатаОбнаружения КАК ДатаОбнаружения,
	|	НеРегламентыОбщее.ВидРемонта КАК ВидРемонта,
	|	НеРегламентыОбщее.ДокАкт КАК ДокАкт,
	|	НеРегламентыОбщее.Смета КАК Смета
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	НеРегламентыОбщее КАК НеРегламентыОбщее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО НеРегламентыОбщее.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегламентыОбщее.РассчитыватьВремя,
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта,
	|	РегламентыОбщее.ИД,
	|	РегламентыОбщее.ПланДатаНач,
	|	РегламентыОбщее.ПланДатаКон,
	|	РегламентыОбщее.ФактДатаНач,
	|	РегламентыОбщее.ФактДатаКон,
	|	РегламентыОбщее.ДокИнициатор,
	|	РегламентыОбщее.ДатаОбнаружения,
	|	РегламентыОбщее.ВидРемонта,
	|	РегламентыОбщее.ДокАкт,
	|	NULL
	|ИЗ
	|	РегламентыОбщее КАК РегламентыОбщее
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО РегламентыОбщее.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламентыОбщее
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегламентыОбщее
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.РассчитыватьВремя КАК РассчитыватьВремя,
	|	Данные.ОбъектРемонта КАК ОбъектРемонта,
	|	Данные.ИД КАК ИД,
	|	Данные.ПланДатаНач КАК ПлановаяДатаНачала,
	|	Данные.ПланДатаКон КАК ПлановаяДатаОкончания,
	|	Данные.ФактДатаНач КАК ФактическаяДатаНачала,
	|	Данные.ФактДатаКон КАК ФактическаяДатаОкончания,
	|	Данные.ДокИнициатор КАК ДокИнициатор,
	|	Данные.ДатаОбнаружения КАК ДатаОбнаружения,
	|	Данные.ВидРемонта КАК Ремонт,
	|	Данные.ДокАкт КАК ДокументАкт,
	|	ВЫБОР
	|		КОГДА Данные.ФактДатаКон <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ""Работы завершены""
	|		КОГДА Данные.ФактДатаНач <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ""Работы начаты""
	|		ИНАЧЕ ""Работы не начаты""
	|	КОНЕЦ КАК СтатусВыполнения,
	|	ВЫБОР
	|		КОГДА Данные.РассчитыватьВремя = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Данные.ФактДатаКон = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(Данные.ФактДатаНач, Данные.ФактДатаКон, СЕКУНДА), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДлительностьРемонта,
	|	ВЫБОР
	|		КОГДА Данные.РассчитыватьВремя = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Данные.ФактДатаКон = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(Данные.ДатаОбнаружения, Данные.ФактДатаКон, СЕКУНДА), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДлительностьУстраненияДефекта,
	|	ВЫБОР
	|		КОГДА Данные.РассчитыватьВремя = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Данные.ФактДатаНач = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(Данные.ДатаОбнаружения, Данные.ФактДатаНач, СЕКУНДА), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВремяРеакции,
	|	Данные.Смета КАК Смета
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	Данные КАК Данные"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ЗапросТекст = дс_ДобавитьПараметрыВТекстЗапроса(ЗапросТекст);
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
	Возврат ЗапросТекст;
	
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
#Область Локализация

Функция дс_ДобавитьПараметрыВТекстЗапроса(ТекстЗапроса)
	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""Работы завершены""", 	"&РаботыЗавершены");
	СтрокиЗамены.Вставить("""Работы начаты""", 		"&РаботыНачаты");
	СтрокиЗамены.Вставить("""Работы не начаты""", 	"&РаботыНеНачаты");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
КонецФункции
 
Процедура дс_ДобавитьПараметрыВСКД()
	Переводы = Новый Соответствие;

	Переводы.Вставить("РаботыЗавершены", 	НСтр("es='El trabajo se haya completado';ru='Работы завершены';en='Work completed'"));
	Переводы.Вставить("РаботыНачаты", 		НСтр("es='El trabajo iniciado';ru='Работы начаты';en='Work started'"));
	Переводы.Вставить("РаботыНеНачаты", 	НСтр("es='El trabajo no se desarrollan';ru='Работы не начаты';en='Work is not started'"));
	
	Для каждого Перевод Из Переводы Цикл
		Если СхемаКомпоновкиДанных.Параметры.Найти(Перевод.Ключ) = Неопределено Тогда
			НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
			НовыйПараметр.Имя 			= Перевод.Ключ;
			НовыйПараметр.Значение 		= Перевод.Значение;
			НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 
// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

#КонецОбласти

#КонецЕсли
